tap "adoptopenjdk/openjdk"
tap "hashicorp/tap"
tap "homebrew/bundle"
brew "bash"
brew "freetype"
brew "fontconfig"
brew "cairo"
brew "cask"
brew "docker-machine"
brew "gh"
brew "git"
brew "gnu-tar"
brew "go"
brew "harfbuzz"
brew "libtiff"
brew "little-cms2"
brew "gradle"
brew "helm"
brew "htop"
brew "kubernetes-cli"
brew "mas"
brew "minikube"
brew "neofetch"
brew "node"
brew "nvm"
brew "nyx"
brew "openjdk@17"
brew "openssh"
brew "pipenv"
brew "poppler"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "qemu"
brew "rename"
brew "scala"
brew "stress"
brew "tesseract"
brew "tesseract-lang"
brew "tiger-vnc"
brew "vim"
brew "watch"
brew "wget"
brew "wsk"
brew "xclip"
cask "anaconda"
cask "discord"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "gureumkim"
cask "hashicorp-vagrant"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "notion"
cask "slack"
cask "tabby"
cask "termius"
cask "utm"
cask "vagrant"
cask "visual-studio-code"
cask "vmware-fusion"
cask "vnc-viewer"
mas "카카오톡", id: 869223134
mas "한컴오피스 한글 Viewer", id: 416746898
vscode "abusaidm.html-snippets"
vscode "alefragnani.project-manager"
vscode "batisteo.vscode-django"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "franneck94.c-cpp-runner"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kaysonwu.cpptask"
vscode "kevinrose.vsc-python-indent"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "okteto.remote-kubernetes"
vscode "phantom.gcc-md"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "searking.preview-vscode"
vscode "shakram02.bash-beautify"
vscode "shan.code-settings-sync"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "slevesque.vscode-zipexplorer"
vscode "tal7aouy.rainbow-bracket"
vscode "tht13.python"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
